{
  "architectures": [
    "MobileBertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_activation": false,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 128,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 512,
  "id2label": {
    "0": "IGNORE",
    "1": "UPDATE_CONTEXT",
    "2": "ACT_set_timer",
    "3": "ACT_add_calendar_event",
    "4": "ACT_play_music",
    "5": "ACT_web_search",
    "6": "ACT_smart_home_control"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "intra_bottleneck_size": 128,
  "key_query_shared_bottleneck": true,
  "label2id": {
    "ACT_add_calendar_event": 3,
    "ACT_play_music": 4,
    "ACT_set_timer": 2,
    "ACT_smart_home_control": 6,
    "ACT_web_search": 5,
    "IGNORE": 0,
    "UPDATE_CONTEXT": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "mobilebert",
  "normalization_type": "no_norm",
  "num_attention_heads": 4,
  "num_feedforward_networks": 4,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.6.2",
  "trigram_input": true,
  "true_hidden_size": 128,
  "type_vocab_size": 2,
  "use_bottleneck": true,
  "use_bottleneck_attention": false,
  "use_cache": false,
  "vocab_size": 30522
}
